package silly.h1024h.common

val ERROR_MAP = mapOf(
        1000 to "用户已存在",
        1001 to "注册失败",
        1002 to "参数错误",
        1003 to "邮箱格式不正确",
        1004 to "电话号码格式不正确",
        1005 to "请填写正确的用户名",
        1006 to "验证码已过期",
        1007 to "上传失败",
        1008 to "计数失败",
        1009 to "帐号必须是8-16位数字或字母",
        1010 to "密码必须是8-16位数字和字母的组合",
        1011 to "用户不存在，请注册",
        1012 to "密码错误",
        1013 to "提交失败",
        1014 to "验证码错误",
        1015 to "绑定失败",
        1016 to "验证码发送失败",
        1017 to "地址获取失败",
        1018 to "参数不能为空",
        1019 to "ac不存在",
        1020 to "登录失败",
        1021 to "验证码发送失败",
        1022 to "更改失败"
)